#+title: Organisation
#+COLUMNS: %58ITEM(Task) %7TODO %6CLOCKSUM(Clock)

* Organisation

** DONE [#A] Chunking [1/1]
:LOGBOOK:
CLOCK: [2023-10-21 Sat 12:44]--[2023-10-21 Sat 13:02] =>  0:18
:END:
- [X]  Write everything down what is in the head, Prioritise it, Make it nice.
  - [X] Just ignore and write a step by step guide to get something running

*** Quick Breakdown

Goal: Develop a web3ar Expierience
- UI/UX
- Frontend
- Backend
- SmartContract
- 3D

UI/UX:
1. Colors
2. Typography
3. One Button
4. UserFlow
5. Wireframe
6. One Card
7. One Frame

Frontend:
1. Create a HTML Page
2. Start dev Server
3. Write a heading, write a paragraph
4. Write style to get red of default
5. Add Canvas
6. Draw a line via javascipt
7. Declare Victory
8. Add ThreeJS
9. Show Cube in canvas
10. Add MindAR
11. Get Default Scene to run
12. Add Button
13. On Button Click change Background
14. Declare Victory

Backend:
1. Create an app.js file
2. Install express
3. Serve a stupid json
4. Got to frontend, fetch and console.log() json

SmartContract:
1. Create a ink Project
2. Add storage to store count
3. Add function to increase count
4. Add function to get count
5. start node and deploy contract
6. call function via terminal
7. call function via substrate ui
8. Got to frontend, fetch and count
9. Got to frontend, increase count
10. Got to frontend, fetch and count

3D:
1. Open Blender
2. Export Cube
3. Save it


** TODO [#A] Quick and Rough [4/8]
:LOGBOOK:
CLOCK: [2023-10-21 Sat 13:02]--[2023-10-21 Sat 13:17] =>  0:15
:END:
*** TODO [#C] UX/UX [4/8]
:LOGBOOK:
CLOCK: [2023-10-21 Sat 18:59]--[2023-10-21 Sat 20:52] =>  1:53
CLOCK: [2023-10-21 Sat 18:03]--[2023-10-21 Sat 18:50] =>  0:47
CLOCK: [2023-10-21 Sat 15:00]--[2023-10-21 Sat 15:25] =>  0:25
CLOCK: [2023-10-21 Sat 14:46]--[2023-10-21 Sat 14:59] =>  0:13
CLOCK: [2023-10-21 Sat 14:05]--[2023-10-21 Sat 14:42] =>  0:37
CLOCK: [2023-10-21 Sat 13:17]--[2023-10-21 Sat 13:22] =>  0:05
:END:
- [X] Colors
  - [X] Set Up Komorebic for Quick Switching
  - [X] Create new Figma File
  - [X] use coolors.io
  - [X] create minimal colorschema
- [X] Typography
  - [X] Create Frame
  - [X] Create Heading, Paragraph, Bold, Italic
  - [X] Add AutoLayout
  - [X] Add AutoLayout of Colors
  - [X] Add Variations of Colors
  - [X] Add Icon Page
  - [X] Set Styles to FigFile
- [X] One Button
- [ ] UserFlow
- [ ] Wireframe
- [ ] One Card
- [ ] One Page
- [X] Export a pdf Design System, minimalistic
*** DONE [#A] Frontend [18/18]
:LOGBOOK:
CLOCK: [2023-10-22 Sun 16:58]--[2023-10-22 Sun 18:59] =>  2:01
CLOCK: [2023-10-22 Sun 10:58]--[2023-10-22 Sun 12:36] =>  1:38
CLOCK: [2023-10-22 Sun 09:43]--[2023-10-22 Sun 10:42] =>  0:59
CLOCK: [2023-10-22 Sun 08:33]--[2023-10-22 Sun 09:30] =>  0:57
CLOCK: [2023-10-22 Sun 08:13]--[2023-10-22 Sun 08:32] =>  0:19
:END:
- [X] Create a HTML Page
- [X] Start dev Server
- [X] Write a heading, write a paragraph
- [X] Write style to get red of default
- [X] Add Canvas
- [X] Draw a line via javascipt
- [X] Add tiny animation
- [X] Declare Victory
- [X] refactor it, split files
- [X] Add ThreeJS
- [X] Show Cube in canvas
- [X] modularize Code
- [X] Animate Cube
- [X] Add MindAR
- [X] Fix Chrome Camera
- [X] Get Default Scene to run
- [X] Add Button
- [X] Declare Victory
*** DONE [#C] Backend [4/4]
:LOGBOOK:
CLOCK: [2023-10-22 Sun 19:46]--[2023-10-22 Sun 19:56] =>  0:10
:END:
- [X] Create an app.js file
- [X] Install express
- [X] Serve a stupid json
- [X] Got to frontend, fetch and console.log() json
*** TODO [#A] SmartContract [7/9]
:LOGBOOK:
CLOCK: [2023-10-22 Sun 20:45]--[2023-10-22 Sun 21:46] =>  1:01
:END:
- [X] Create a ink Project
- [X] Add storage to store count
- [X] Add function to flip value
- [X] Add function to get value
- [X] start node and deploy contract
- [X] call function via terminal
- [X] call function via substrate ui
- [ ] Go to frontend, fetch value
- [ ] Go to frontend, increase flip value
*** DONE [#C] 3D [3/3]
:LOGBOOK:
CLOCK: [2023-10-22 Sun 21:49]--[2023-10-22 Sun 21:52] =>  0:03
:END:
- [X] Open Blender
- [X] Export Cube
- [X] Save it

*** DONE [#C] Diverse [3/3]
:LOGBOOK:
CLOCK: [2023-10-22 Sun 23:42]--[2023-10-22 Sun 23:54] =>  0:12
CLOCK: [2023-10-22 Sun 21:53]--[2023-10-22 Sun 23:38] =>  1:45
:END:
- [X] Document Day
- [X] Add it to Vitepress
- [X] Publish it

*** DONE [#A] Repair PC [11/11]
- [X] WLan Drive Broken, repair it
- [X] Doesn work, reset pc with keeping filex
- [X] Get hearattack, when realise that wsl is deinstalled
- [X] Get old XP Laptop running
- [X] Download Puppy OS
- [X] Boot from USB Stick
- [X] Connect via Lan and share working Wifi
- [X] Find Seedphrased to wallets
- [X] Set up PC
- [X] Set up Dev enviorment
- [X] Back on Track, drink a Tea

*** TODO [#A] Finish steps before add Steps [23/29]
:LOGBOOK:
CLOCK: [2023-10-25 Wed 20:25]
CLOCK: [2023-10-25 Wed 20:04]--[2023-10-25 Wed 20:15] =>  0:11
CLOCK: [2023-10-25 Wed 18:01]--[2023-10-25 Wed 18:43] =>  0:42
CLOCK: [2023-10-25 Wed 17:23]--[2023-10-25 Wed 18:00] =>  0:37
CLOCK: [2023-10-25 Wed 16:49]--[2023-10-25 Wed 17:13] =>  0:24
CLOCK: [2023-10-25 Wed 13:03]--[2023-10-25 Wed 16:43] =>  3:40
CLOCK: [2023-10-25 Wed 09:08]--[2023-10-25 Wed 12:16] =>  3:08
CLOCK: [2023-10-25 Wed 07:32]--[2023-10-25 Wed 08:55] =>  1:23
CLOCK: [2023-10-24 Tue 19:02]--[2023-10-25 Wed 01:58] =>  6:56
CLOCK: [2023-10-24 Tue 16:03]--[2023-10-24 Tue 17:01] =>  0:58
CLOCK: [2023-10-24 Tue 10:43]--[2023-10-24 Tue 11:20] =>  0:37
CLOCK: [2023-10-24 Tue 09:14]--[2023-10-24 Tue 10:21] =>  1:07
:END:
- [ ] UserFlow
- [ ] Wireframe
- [ ] One Card
- [ ] One Page
- [X] Got to frontend, fetch and console.log() json
- [X] Go to frontend, fetch value
- [ ] Go to frontend, increase flip value
- [X] Get React working with MindAR
- [X] Explore MindAR React example, add it to playground
- [X] Install right dependencies
- [X] Make food for guests
- [X] Help somewhere out
- [X] felt demotiviated, no much progress
- [X] help friend to improve his project
  - [X] get truffle correctly running
  - [X] write migration script
  - [X] write testimport metadata from 'contract/metadata.json's
  - [X] use of truffle console
  - [X] create frontend thingy
  - [X] create div for blocknumber updater
  - [X] create div for contract deployment via form
  - [X] create div for call contract
  - [X] modularize it
  - [X] create footer and header
  - [X] call it a day
- [X] sleepy and more motivated for Wednesday
- [X] write Tuesday.md
- [X] add bullet points to vitepress
- [X] try to reproduce react mind ar repo
- [X] comment github issue on tresjs
- [X] debug fetch, because of wsl
- [X] try to port it to windows
- [X] figured out that use(cors) is the actually error
- [X] create fetchSmartContract Component
- [X] add useInk
- [X] add Custom Local chain config
- [X] get Metadata, recompile
- [X] connect to wallet
- [X] disconnect to wallet
- [ ] make it work
